#include <stdio.h>
/* יש שיטה לייצוג הזיכרון בצורה כזו שמאפשר לנו לבחור לאיזה byte מתוך 2 הבתים (בדוגמה זו) אנו רוצים לכתוב, 
	מה שעשינו כאן - בחרנו לכתוב לbyte בכל הכתובת הנמוכה יותר. במידה וזה מייצג 00000001 (כלומר 1) - אנחנו במערכת מסוג little endian */
#define IS_LITTLE_ENDIAN() (*(short*)"\x0001\0000" == 1)

int main()
{
	int n = 1;
	/*
	כאשר מערכת עובדת לפי little endian, אזי הByte הכי "חלש" יהיה בכתובת קטנה יותר, למשל מספר עשרוני מסוג int שייצוגו הבינארי הוא באמצעות 2 בתים
	הבית המשמעותי יותר יהיה בכתובת גבוהה יותר בזיכרון, כלומר, מתחילים לכתוב את הבית הראשון בכתובת הקטנה יותר, לכן, נעשה int num=1, נפנה למשתנה
	מסוג int באמצעות מצביע לchar כדי להסתכל על הבית הראשון מתוך ארבעה בתים. אם ה1 מאוחסן שם(00000001), אזי שמדובר במערכת מסוג little.
	במערכת מסוג big endian היינו מצפים שה00000001 יאוחסן בByte הרביעי מתוף ארבעה בתים (הbytes בתמונת מראה, לא הbits שמסודרים בתוך כל Byte!!!!!)
	*/
	if(*(char *)&n == 1) 
	{
		printf("Little endian\n");
	}
	
	else
	{
	printf("Big endian\n");	
	}
	

	return 0;
}
